{   "terms": [     {       "id": "v1-decision-speed",       "title": "V1 – Decision Speed",       "category": "Performance",       "sections": {         "whatItIs": {           "content": "V1 is the maximum speed in the takeoff at which the pilot must decide to continue or reject the takeoff following an engine failure or other significant abnormality."         },         "howItWorks": {           "content": "V1 is determined during aircraft certification and performance calculations. It considers runway length, aircraft weight, and environmental conditions to ensure sufficient stopping distance or continued takeoff capability."         },         "whatYouShouldDo": {           "content": "During takeoff roll, if a critical failure occurs before V1, reject the takeoff. After V1, continue the takeoff and follow engine-out procedures as per the aircraft’s operating manual."         },         "troubleshooting": {           "content": "If unsure of V1 due to incorrect data entry or conditions change, recompute performance using current weight, temperature, and runway data before departure."         }       },       "synonyms": ["Decision Speed", "Takeoff Decision Speed"],       "tags": ["takeoff", "speed", "performance", "runway", "safety"],       "relationships": [],       "createdAt": "2025-10-30T00:00:00Z",       "updatedAt": "2025-10-30T00:00:00Z"     },     {       "id": "vr-rotation-speed",       "title": "VR – Rotation Speed",       "category": "Performance",       "sections": {         "whatItIs": {           "content": "VR is the speed at which the pilot initiates pitch-up during takeoff to achieve liftoff attitude and transition from ground roll to flight."         },         "howItWorks": {           "content": "VR is calculated based on weight, configuration, and runway conditions, ensuring adequate control margin and stall protection. It is typically greater than or equal to V1 and less than or equal to V2."         },         "whatYouShouldDo": {           "content": "At VR, smoothly apply back pressure on the control column to achieve the target pitch rate. Maintain VR+10 until positive climb is established."         },         "troubleshooting": {           "content": "If rotation feels sluggish or nose fails to lift, verify stabilizer trim setting and elevator control function before next takeoff."         }       },       "synonyms": ["Rotation Speed"],       "tags": ["takeoff", "speed", "rotation", "performance", "flight-controls"],       "relationships": [],       "createdAt": "2025-10-30T00:00:00Z",       "updatedAt": "2025-10-30T00:00:00Z"     },     {       "id": "v2-takeoff-safety-speed",       "title": "V2 – Takeoff Safety Speed",       "category": "Performance",       "sections": {         "whatItIs": {           "content": "V2 is the target climb speed after takeoff with one engine inoperative, ensuring adequate climb gradient and controllability."         },         "howItWorks": {           "content": "V2 is calculated during performance planning and is based on aircraft configuration, weight, and engine-out climb capability. It provides sufficient margin above stall speed for safe climb-out."         },         "whatYouShouldDo": {           "content": "After liftoff, maintain V2 until reaching acceleration altitude, then accelerate and retract flaps as per the standard takeoff profile."         },         "troubleshooting": {           "content": "If unable to maintain V2, verify engine thrust, flap setting, and flight director command. Consider lowering pitch slightly to regain airspeed while maintaining climb gradient."         }       },       "synonyms": ["Takeoff Safety Speed"],       "tags": ["takeoff", "climb", "engine-out", "performance", "safety"],       "relationships": [],       "createdAt": "2025-10-30T00:00:00Z",       "updatedAt": "2025-10-30T00:00:00Z"     },     {       "id": "takeoff-performance",       "title": "Takeoff Performance",       "category": "Performance",       "sections": {         "whatItIs": {           "content": "Takeoff performance defines the aircraft’s ability to safely accelerate, rotate, and lift off within the available runway distance under given conditions."         },         "howItWorks": {           "content": "It depends on thrust, aircraft weight, runway slope, temperature, pressure altitude, and wind. Performance charts or electronic flight bags provide required field lengths and speeds."         },         "whatYouShouldDo": {           "content": "Before takeoff, verify computed data for runway length, weight, and temperature. Apply takeoff thrust smoothly and monitor acceleration and engine parameters."         },         "troubleshooting": {           "content": "If acceleration is below expected, reject the takeoff before V1 or assess engine performance and anti-ice usage. Recalculate performance before reattempt."         }       },       "synonyms": ["Takeoff Distance", "Field Length", "Runway Performance"],       "tags": ["takeoff", "performance", "runway", "speed", "safety"],       "relationships": [],       "createdAt": "2025-10-30T00:00:00Z",       "updatedAt": "2025-10-30T00:00:00Z"     },     {       "id": "landing-distance",       "title": "Landing Distance",       "category": "Performance",       "sections": {         "whatItIs": {           "content": "Landing distance is the total runway length required to safely land and come to a complete stop from a specified approach speed under given conditions."         },         "howItWorks": {           "content": "It is affected by aircraft weight, flap setting, wind, runway slope, and braking efficiency. Performance charts define required distances for dry and wet conditions."         },         "whatYouShouldDo": {           "content": "Compute landing distance before approach using current weight and weather. Verify available runway length meets or exceeds required landing distance with margin."         },         "troubleshooting": {           "content": "If landing roll is longer than expected, use maximum braking, spoilers, and reverse thrust as appropriate. Review brake temperature and anti-skid operation after taxi-in."         }       },       "synonyms": ["Landing Performance", "Runway Requirement"],       "tags": ["landing", "runway", "performance", "speed", "braking"],       "relationships": [],       "createdAt": "2025-10-30T00:00:00Z",       "updatedAt": "2025-10-30T00:00:00Z"     }   ] }